Статистика работы механизмов/Конфигурация/DataProcessors/_ОповещениеПриПервомПоступленииДСНаСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ОповещениеПриПервомПоступленииДСНаСчет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучателиОповещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ОповещениеПриПервомПоступленииДСНаСчет/_ОповещениеПриПервомПоступленииДСНаСчет/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		"ДополнительнаяОбработка",
		"Оповещение при первом поступлении ДС на счет",
		"1.14",
		"",
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОповещениеПриПервомПоступленииДСНаСчет",  "Оповещение при первом поступлении ДС на счет Регион ЭСМ",,  Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОповещениеПриПервомПоступленииДСНаСчет1",  "Оповещение при первом поступлении ДС на счет Регион ПИ",,  Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОповещениеПриПервомПоступленииДСНаСчет2",  "Оповещение при первом поступлении ДС на счет Регион Траст",,  Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска обработки
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию(ИдентификаторКоманды);
	Попытка
	
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	
	// Проверка должна выполняться только по рабочим дням.
	Если НЕ Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, ТекущаяДата) Тогда
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	Иначе
		ДатаПроверки = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, ТекущаяДата - 86400);
	КонецЕсли;
	
	Организация				= ПараметрыКоманды.Организация;
	Сумма					= ПараметрыКоманды.Сумма;
	ПолучателиОповещения	= ПараметрыКоманды.ПолучателиОповещения;
	
	Если Найти(ИдентификаторКоманды, "ОповещениеПриПервомПоступленииДСНаСчет") > 0 Тогда
		ПроверитьБанковскиеСчета(ДатаПроверки);
		ПроверитьДепозитныеВклады(ДатаПроверки);
	КонецЕсли;
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры // ВыполнитьКоманду

Процедура ПроверитьБанковскиеСчета(ДатаПроверки) Экспорт
	
	МассивБанковскихСчетов = ПолучитьМассивБанковскихСчетов(ДатаПроверки);
	
	Если МассивБанковскихСчетов.Количество() > 0 Тогда
		СписокБанковскихСчетов = "";
		
		Для Каждого БанковскийСчет Из МассивБанковскихСчетов Цикл
			СписокБанковскихСчетов = ?(ЗначениеЗаполнено(СписокБанковскихСчетов), СписокБанковскихСчетов + Символы.ПС, "") + Строка(БанковскийСчет);
		КонецЦикла;
		
		ТемаПисьма = "По банковским счетам первое поступление ДС >= " + Сумма;
		
		ТекстПисьма = 
			"По банковским счетам:
			|
			|[БанковскийСчет] 
			|сумма прихода за " + Формат(ДатаПроверки, "ДЛФ=DD") + " превысила [Сумма] рублей.";
			
		ТекстПисьма = СтрЗаменить(ТекстПисьма, "[БанковскийСчет]", СписокБанковскихСчетов + Символы.ПС);
		ТекстПисьма = СтрЗаменить(ТекстПисьма, "[Сумма]", Сумма);
		
		РаботаСЭлектроннойПочтой.ОтправитьПростоеЭлектронноеПисьмо(ПолучателиОповещения, ТемаПисьма, ТекстПисьма);	
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДепозитныеВклады(ДатаПроверки) Экспорт
	
	МассивДепозитныхВкладов = ПолучитьМассивДепозитныхВкладов(ДатаПроверки);
	
	Если МассивДепозитныхВкладов.Количество() > 0 Тогда
		СписокДепозитныхВкладов = "";
		
		Для Каждого ДепозитныйВклад Из МассивДепозитныхВкладов Цикл
			СписокДепозитныхВкладов = ?(ЗначениеЗаполнено(СписокДепозитныхВкладов), СписокДепозитныхВкладов + Символы.ПС, "") + Лев(Строка(ДепозитныйВклад) + "                                            ", 150);
		КонецЦикла;
		
		ТемаПисьма = "По депозитным вкладам первое поступление ДС >= " + Сумма;
		
		ТекстПисьма = 
			"По депозитным вкладам:
			|
			|[ДепозитныйВклад] 
			|сумма прихода за " + Формат(ДатаПроверки, "ДЛФ=DD") + " превысила [Сумма] рублей.";
			
		ТекстПисьма = СтрЗаменить(ТекстПисьма, "[ДепозитныйВклад]", СписокДепозитныхВкладов + Символы.ПС);
		ТекстПисьма = СтрЗаменить(ТекстПисьма, "[Сумма]", Сумма);
		
		РаботаСЭлектроннойПочтой.ОтправитьПростоеЭлектронноеПисьмо(ПолучателиОповещения, ТемаПисьма, ТекстПисьма);	
	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьМассивБанковскихСчетов(ДатаПроверки)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОстаткиДенежныхСредствОбороты.РасчетныйСчет КАК РасчетныйСчет
		|ПОМЕСТИТЬ ВТРасчетныеСчета
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Обороты(
		|			НАЧАЛОПЕРИОДА(&ДатаПроверки, ДЕНЬ),
		|			КОНЕЦПЕРИОДА(&ДатаПроверки, ДЕНЬ),
		|			День,
		|			РасчетныйСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|				И Организация = &Организация) КАК ОстаткиДенежныхСредствОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПроверки, ) КАК КурсыВалютСрезПоследних
		|		ПО ОстаткиДенежныхСредствОбороты.Валюта = КурсыВалютСрезПоследних.Валюта
		|ГДЕ
		|	ОстаткиДенежныхСредствОбороты.СуммаПриход / ВЫБОР
		|			КОГДА КурсыВалютСрезПоследних.Кратность > 0
		|				ТОГДА КурсыВалютСрезПоследних.Кратность
		|			ИНАЧЕ 1
		|		КОНЕЦ * КурсыВалютСрезПоследних.Курс >= &Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТРасчетныеСчета.РасчетныйСчет КАК РасчетныйСчет
		|ИЗ
		|	ВТРасчетныеСчета КАК ВТРасчетныеСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиДенежныхСредств.Обороты(, КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаПроверки, ДЕНЬ, -1), ДЕНЬ), Год, Организация = &Организация) КАК ОстаткиДенежныхСредствОбороты
		|		ПО ВТРасчетныеСчета.РасчетныйСчет = ОстаткиДенежныхСредствОбороты.РасчетныйСчет
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТРасчетныеСчета.РасчетныйСчет
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ОстаткиДенежныхСредствОбороты.РасчетныйСчет) = 0";
	
	Запрос.УстановитьПараметр("ДатаПроверки",	ДатаПроверки);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Сумма",			Сумма);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("РасчетныйСчет");
	
КонецФункции

Функция ПолучитьМассивДепозитныхВкладов(ДатаПроверки)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДенежныеСредстваВКредитныхИнструментахОбороты.КредитныйИнструмент КАК ДепозитныйВклад
		|ПОМЕСТИТЬ ВТ_Депозиты
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Обороты(
		|			НАЧАЛОПЕРИОДА(&ДатаПроверки, ДЕНЬ),
		|			КОНЕЦПЕРИОДА(&ДатаПроверки, ДЕНЬ),
		|			День,
		|			Организация = &Организация
		|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПроверки, ) КАК КурсыВалютСрезПоследних
		|		ПО (ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментахОбороты.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Валюта = КурсыВалютСрезПоследних.Валюта)
		|ГДЕ
		|	ДенежныеСредстваВКредитныхИнструментахОбороты.СуммаПриход / ВЫБОР
		|			КОГДА КурсыВалютСрезПоследних.Кратность > 0
		|				ТОГДА КурсыВалютСрезПоследних.Кратность
		|			ИНАЧЕ 1
		|		КОНЕЦ * КурсыВалютСрезПоследних.Курс >= &Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Депозиты.ДепозитныйВклад КАК ДепозитныйВклад
		|ИЗ
		|	ВТ_Депозиты КАК ВТ_Депозиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Обороты(
		|				,
		|				КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаПроверки, ДЕНЬ, -1), ДЕНЬ),
		|				Год,
		|				Организация = &Организация
		|					И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОбороты
		|		ПО ВТ_Депозиты.ДепозитныйВклад = ДенежныеСредстваВКредитныхИнструментахОбороты.КредитныйИнструмент
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Депозиты.ДепозитныйВклад
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ДенежныеСредстваВКредитныхИнструментахОбороты.КредитныйИнструмент) = 0";
	
	Запрос.УстановитьПараметр("ДатаПроверки",	ДатаПроверки);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Сумма",			Сумма);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДепозитныйВклад");
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////

#Область СтатистикаРаботыВнутреннихМеханизмов

Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки) Экспорт

	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыСессии.ТекстОшибки) Тогда
		ПараметрыСессии.ТекстОшибки = ПараметрыСессии.ТекстОшибки + Символы.ПС + ТекстОшибки;
	Иначе
		ПараметрыСессии.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

КонецПроцедуры

Функция ЗарегистрироватьНовуюСессию(ИмяКоманды) Экспорт
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",       Сессия);
	ПараметрыСессии.Вставить("ДопПараметры", Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",  Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии) Экспорт
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
